{
    "characters": [
        {
            "name": "Luke Skywalker",
            "description": "Jedi whose coming of age and rise as a Jedi are portrayed in the original Star Wars trilogy. Son of Anakin Skywalker and Padmé Amidala, and Leia Organa's twin brother",
            "hasForce": true,
            "side": "light",
            "franchise": "starwars"
        },
        {
            "name": "Admiral Gial Ackbar",
            "description": "Commands the Rebel fleet in their attack against the second Death Star in Return of the Jedi. Ackbar is a Mon Calamari leader and military commander who fought in the Clone Wars. He devotes himself to the cause of galactic freedom and becomes the foremost military commander of the Rebel Alliance, and later the New Republic. He later works alongside General Leia Organa as part of the Resistance in The Force Awakens. He is killed along with many Resistance leaders in The Last Jedi.",
            "hasForce": false,
            "side": "light",
            "franchise": "starwars"
        },
        {
            "name": "Jar Jar Binks",
            "description": "Hapless but good-natured Gungan who journeys with Qui-Gon Jinn to Coruscant.",
            "hasForce": false,
            "side": "light",
            "franchise": "starwars"
        },
        {
            "name": "Chewbacca",
            "description": "Han Solo's Wookiee partner and co-pilot of the Millennium Falcon.",
            "hasForce": false,
            "side": "light",
            "franchise": "starwars"
        },
        {
            "name": "Anakin Skywalker",
            "description": "Jedi whose fall and redemption are portrayed in the Star Wars films. His master was Obi-Wan Kenobi. He was married to Padmé Amidala; father of Luke and Leia. He is an excellent podracer and he is 'the Chosen One'. Known as 'Darth Vader' after his fall to the dark side.",
            "hasForce": true,
            "side": "dark",
            "franchise": "starwars"
        },
        {
            "name": "Boba Fett",
            "description": "Bounty hunter and nemesis of Han Solo and Mace Windu, he is a clone of Jango Fett raised by Jango on Kamino as his son. He is one of the six bounty hunters hired by Darth Vader to find the Millennium Falcon in The Empire Strikes Back. He finds the ship and brings a bounty of its captain, Han Solo, frozen in carbonite, to Jabba the Hutt. He appears again in Return of the Jedi, at Jabba's palace. When Luke Skywalker and his friends come to rescue Han, Fett falls into the mouth of Jabba's Sarlacc during the fight.",
            "hasForce": false,
            "side": "dark",
            "franchise": "starwars"
        },
        {
            "name": "Jabba the Hutt",
            "description": "Crime boss employing bounty hunters in the A New Hope Special Edition, Return of the Jedi, The Phantom Menace, and The Clone Wars, killed by Princess Leia aboard his sail barge in Return of the Jedi. His full name is Jabba Desilijic Tiure.",
            "hasForce": false,
            "side": "dark",
            "franchise": "starwars"
        },
        {
            "name": "Obi-Wan Kenobi",
            "description": "Wise and skilled Jedi Master who trains Anakin and later Luke Skywalker. A member of the Jedi Council and one of the survivors of the Great Jedi Purge, Obi-Wan is also a Jedi General during the Clone Wars. He kills General Grievous and defeated Darth Maul, and his master is Qui-Gon Jinn, who is killed by Maul. Obi-Wan is slain In A New Hope by his former apprentice Anakin, who had become Darth Vader. Guinness' and McGregor's voices as Obi-Wan can be heard in The Force Awakens during a vision sequence featuring the character Rey.",
            "hasForce": true,
            "side": "light",
            "franchise": "starwars"
        }
    ]
}